#### Tofu Plan Output - observability_stack_ctrl_plane_infra
```

[1m[36mNote:[0m[1m Objects have changed outside of OpenTofu
[0m
OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

[1m  # module.gke.google_container_cluster.primary[0m has changed
[0m  [33m~[0m[0m resource "google_container_cluster" "primary" {
        id                                       = "projects/ctrl-plane-prod-b1b92df2/locations/us-central1/clusters/observability-stack-uvm2"
      [33m~[0m[0m master_version                           = "1.31.6-gke.1020000" [33m->[0m[0m "1.31.7-gke.1212000"
        name                                     = "observability-stack-uvm2"
      [33m~[0m[0m node_version                             = "1.31.6-gke.1020000" [33m->[0m[0m "1.31.6-gke.1064001"
        [90m# (27 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m node_pool {
            name                        = "default-pool"
          [33m~[0m[0m version                     = "1.31.6-gke.1020000" [33m->[0m[0m "1.31.6-gke.1064001"
            [90m# (6 unchanged attributes hidden)[0m[0m

            [90m# (5 unchanged blocks hidden)[0m[0m
        }
      [33m~[0m[0m node_pool {
            name                        = "observability-resources"
          [33m~[0m[0m version                     = "1.31.6-gke.1020000" [33m->[0m[0m "1.31.6-gke.1064001"
            [90m# (6 unchanged attributes hidden)[0m[0m

            [90m# (5 unchanged blocks hidden)[0m[0m
        }
      [33m~[0m[0m node_pool {
            name                        = "public-pool"
          [33m~[0m[0m version                     = "1.31.6-gke.1020000" [33m->[0m[0m "1.31.6-gke.1064001"
            [90m# (6 unchanged attributes hidden)[0m[0m

            [90m# (5 unchanged blocks hidden)[0m[0m
        }

        [90m# (22 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

OpenTofu will perform the following actions:

[1m  # google_artifact_registry_repository_iam_member.db_exporter_sa[0m will be created
[0m  [32m+[0m[0m resource "google_artifact_registry_repository_iam_member" "db_exporter_sa" {
      [32m+[0m[0m etag       = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m location   = (known after apply)
      [32m+[0m[0m member     = "serviceAccount:db-exporter-sa@ctrl-plane-prod-b1b92df2.iam.gserviceaccount.com"
      [32m+[0m[0m project    = (known after apply)
      [32m+[0m[0m repository = "projects/ctrl-plane-prod-b1b92df2/locations/us-central1/repositories/backend"
      [32m+[0m[0m role       = "roles/artifactregistry.reader"
    }

[1m  # google_container_node_pool.public[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "public" {
      [33m~[0m[0m cluster                     = "observability-stack-uvm2" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m id                          = "projects/ctrl-plane-prod-b1b92df2/locations/us-central1/clusters/observability-stack-uvm2/nodePools/public-pool" -> (known after apply)
      [33m~[0m[0m initial_node_count          = 0 -> (known after apply)
      [33m~[0m[0m instance_group_urls         = [
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/ctrl-plane-prod-b1b92df2/zones/us-central1-a/instanceGroupManagers/gke-observability-stack-u-public-pool-15ea5e65-grp",
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/ctrl-plane-prod-b1b92df2/zones/us-central1-c/instanceGroupManagers/gke-observability-stack-u-public-pool-5d340561-grp",
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/ctrl-plane-prod-b1b92df2/zones/us-central1-f/instanceGroupManagers/gke-observability-stack-u-public-pool-04673178-grp",
        ] -> (known after apply)
      [33m~[0m[0m managed_instance_group_urls = [
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/ctrl-plane-prod-b1b92df2/zones/us-central1-a/instanceGroups/gke-observability-stack-u-public-pool-15ea5e65-grp",
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/ctrl-plane-prod-b1b92df2/zones/us-central1-c/instanceGroups/gke-observability-stack-u-public-pool-5d340561-grp",
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/ctrl-plane-prod-b1b92df2/zones/us-central1-f/instanceGroups/gke-observability-stack-u-public-pool-04673178-grp",
        ] -> (known after apply)
      [33m~[0m[0m max_pods_per_node           = 25 -> (known after apply)
        name                        = "public-pool"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [33m~[0m[0m node_locations              = [
          [31m-[0m[0m "us-central1-a",
          [31m-[0m[0m "us-central1-c",
          [31m-[0m[0m "us-central1-f",
        ] -> (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [33m~[0m[0m version                     = "1.31.6-gke.1064001" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m autoscaling {
          [33m~[0m[0m location_policy      = "BALANCED" -> (known after apply)
          [31m-[0m[0m total_max_node_count = 0 [90m-> null[0m[0m
          [31m-[0m[0m total_min_node_count = 0 [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

      [33m~[0m[0m management {
          [32m+[0m[0m cluster                     = (known after apply)
          [32m+[0m[0m id                          = (known after apply)
          [32m+[0m[0m initial_node_count          = (known after apply)
          [32m+[0m[0m instance_group_urls         = (known after apply)
          [32m+[0m[0m location                    = (known after apply)
          [32m+[0m[0m managed_instance_group_urls = (known after apply)
          [32m+[0m[0m max_pods_per_node           = (known after apply)
          [32m+[0m[0m name                        = (known after apply)
          [32m+[0m[0m name_prefix                 = (known after apply)
          [32m+[0m[0m node_count                  = (known after apply)
          [32m+[0m[0m node_locations              = (known after apply)
          [32m+[0m[0m operation                   = (known after apply)
          [32m+[0m[0m project                     = (known after apply)
          [32m+[0m[0m version                     = (known after apply)
        } -> (known after apply)

      [33m~[0m[0m network_config {
          [31m-[0m[0m create_pod_range     = false [90m-> null[0m[0m
          [33m~[0m[0m pod_ipv4_cidr_block  = "172.16.8.0/22" -> (known after apply)
          [33m~[0m[0m pod_range            = "pods" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m

          [33m~[0m[0m pod_cidr_overprovision_config {
              [32m+[0m[0m create_pod_range     = (known after apply)
              [32m+[0m[0m enable_private_nodes = (known after apply)
              [32m+[0m[0m pod_ipv4_cidr_block  = (known after apply)
              [32m+[0m[0m pod_range            = (known after apply)
            } -> (known after apply)
        }

      [33m~[0m[0m node_config {
          [33m~[0m[0m disk_type                   = "pd-balanced" -> (known after apply)
          [33m~[0m[0m effective_taints            = [] -> (known after apply)
          [31m-[0m[0m enable_confidential_storage = false [90m-> null[0m[0m
          [33m~[0m[0m guest_accelerator           = [] -> (known after apply)
          [33m~[0m[0m local_ssd_count             = 0 -> (known after apply)
          [33m~[0m[0m logging_variant             = "DEFAULT" -> (known after apply)
          [33m~[0m[0m metadata                    = {
              [31m-[0m[0m "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          [32m+[0m[0m min_cpu_platform            = (known after apply)
          [33m~[0m[0m oauth_scopes                = [
              [31m-[0m[0m "https://www.googleapis.com/auth/cloud-platform",
              [31m-[0m[0m "https://www.googleapis.com/auth/userinfo.email",
            ] -> (known after apply)
          [31m-[0m[0m resource_manager_tags       = {} [90m-> null[0m[0m
          [31m-[0m[0m tags                        = [] [90m-> null[0m[0m
            [90m# (8 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m confidential_nodes {
              [32m+[0m[0m boot_disk_kms_key           = (known after apply)
              [32m+[0m[0m disk_size_gb                = (known after apply)
              [32m+[0m[0m disk_type                   = (known after apply)
              [32m+[0m[0m effective_taints            = (known after apply)
              [32m+[0m[0m enable_confidential_storage = (known after apply)
              [32m+[0m[0m guest_accelerator           = (known after apply)
              [32m+[0m[0m image_type                  = (known after apply)
              [32m+[0m[0m labels                      = (known after apply)
              [32m+[0m[0m local_ssd_count             = (known after apply)
              [32m+[0m[0m logging_variant             = (known after apply)
              [32m+[0m[0m machine_type                = (known after apply)
              [32m+[0m[0m metadata                    = (known after apply)
              [32m+[0m[0m min_cpu_platform            = (known after apply)
              [32m+[0m[0m node_group                  = (known after apply)
              [32m+[0m[0m oauth_scopes                = (known after apply)
              [32m+[0m[0m preemptible                 = (known after apply)
              [32m+[0m[0m resource_labels             = (known after apply)
              [32m+[0m[0m resource_manager_tags       = (known after apply)
              [32m+[0m[0m service_account             = (known after apply)
              [32m+[0m[0m spot                        = (known after apply)
              [32m+[0m[0m tags                        = (known after apply)
            } -> (known after apply)

          [33m~[0m[0m gcfs_config {
              [32m+[0m[0m boot_disk_kms_key           = (known after apply)
              [32m+[0m[0m disk_size_gb                = (known after apply)
              [32m+[0m[0m disk_type                   = (known after apply)
              [32m+[0m[0m effective_taints            = (known after apply)
              [32m+[0m[0m enable_confidential_storage = (known after apply)
              [32m+[0m[0m guest_accelerator           = (known after apply)
              [32m+[0m[0m image_type                  = (known after apply)
              [32m+[0m[0m labels                      = (known after apply)
              [32m+[0m[0m local_ssd_count             = (known after apply)
              [32m+[0m[0m logging_variant             = (known after apply)
              [32m+[0m[0m machine_type                = (known after apply)
              [32m+[0m[0m metadata                    = (known after apply)
              [32m+[0m[0m min_cpu_platform            = (known after apply)
              [32m+[0m[0m node_group                  = (known after apply)
              [32m+[0m[0m oauth_scopes                = (known after apply)
              [32m+[0m[0m preemptible                 = (known after apply)
              [32m+[0m[0m resource_labels             = (known after apply)
              [32m+[0m[0m resource_manager_tags       = (known after apply)
              [32m+[0m[0m service_account             = (known after apply)
              [32m+[0m[0m spot                        = (known after apply)
              [32m+[0m[0m tags                        = (known after apply)
            } -> (known after apply)

          [33m~[0m[0m kubelet_config {
              [32m+[0m[0m boot_disk_kms_key           = (known after apply)
              [32m+[0m[0m disk_size_gb                = (known after apply)
              [32m+[0m[0m disk_type                   = (known after apply)
              [32m+[0m[0m effective_taints            = (known after apply)
              [32m+[0m[0m enable_confidential_storage = (known after apply)
              [32m+[0m[0m guest_accelerator           = (known after apply)
              [32m+[0m[0m image_type                  = (known after apply)
              [32m+[0m[0m labels                      = (known after apply)
              [32m+[0m[0m local_ssd_count             = (known after apply)
              [32m+[0m[0m logging_variant             = (known after apply)
              [32m+[0m[0m machine_type                = (known after apply)
              [32m+[0m[0m metadata                    = (known after apply)
              [32m+[0m[0m min_cpu_platform            = (known after apply)
              [32m+[0m[0m node_group                  = (known after apply)
              [32m+[0m[0m oauth_scopes                = (known after apply)
              [32m+[0m[0m preemptible                 = (known after apply)
              [32m+[0m[0m resource_labels             = (known after apply)
              [32m+[0m[0m resource_manager_tags       = (known after apply)
              [32m+[0m[0m service_account             = (known after apply)
              [32m+[0m[0m spot                        = (known after apply)
              [32m+[0m[0m tags                        = (known after apply)
            } -> (known after apply)

          [33m~[0m[0m shielded_instance_config {
              [32m+[0m[0m boot_disk_kms_key           = (known after apply)
              [32m+[0m[0m disk_size_gb                = (known after apply)
              [32m+[0m[0m disk_type                   = (known after apply)
              [32m+[0m[0m effective_taints            = (known after apply)
              [32m+[0m[0m enable_confidential_storage = (known after apply)
              [32m+[0m[0m guest_accelerator           = (known after apply)
              [32m+[0m[0m image_type                  = (known after apply)
              [32m+[0m[0m labels                      = (known after apply)
              [32m+[0m[0m local_ssd_count             = (known after apply)
              [32m+[0m[0m logging_variant             = (known after apply)
              [32m+[0m[0m machine_type                = (known after apply)
              [32m+[0m[0m metadata                    = (known after apply)
              [32m+[0m[0m min_cpu_platform            = (known after apply)
              [32m+[0m[0m node_group                  = (known after apply)
              [32m+[0m[0m oauth_scopes                = (known after apply)
              [32m+[0m[0m preemptible                 = (known after apply)
              [32m+[0m[0m resource_labels             = (known after apply)
              [32m+[0m[0m resource_manager_tags       = (known after apply)
              [32m+[0m[0m service_account             = (known after apply)
              [32m+[0m[0m spot                        = (known after apply)
              [32m+[0m[0m tags                        = (known after apply)
            } -> (known after apply)

          [33m~[0m[0m workload_metadata_config {
              [32m+[0m[0m boot_disk_kms_key           = (known after apply)
              [32m+[0m[0m disk_size_gb                = (known after apply)
              [32m+[0m[0m disk_type                   = (known after apply)
              [32m+[0m[0m effective_taints            = (known after apply)
              [32m+[0m[0m enable_confidential_storage = (known after apply)
              [32m+[0m[0m guest_accelerator           = (known after apply)
              [32m+[0m[0m image_type                  = (known after apply)
              [32m+[0m[0m labels                      = (known after apply)
              [32m+[0m[0m local_ssd_count             = (known after apply)
              [32m+[0m[0m logging_variant             = (known after apply)
              [32m+[0m[0m machine_type                = (known after apply)
              [32m+[0m[0m metadata                    = (known after apply)
              [32m+[0m[0m min_cpu_platform            = (known after apply)
              [32m+[0m[0m node_group                  = (known after apply)
              [32m+[0m[0m oauth_scopes                = (known after apply)
              [32m+[0m[0m preemptible                 = (known after apply)
              [32m+[0m[0m resource_labels             = (known after apply)
              [32m+[0m[0m resource_manager_tags       = (known after apply)
              [32m+[0m[0m service_account             = (known after apply)
              [32m+[0m[0m spot                        = (known after apply)
              [32m+[0m[0m tags                        = (known after apply)
            } -> (known after apply)
        }

      [33m~[0m[0m upgrade_settings {
          [32m+[0m[0m cluster                     = (known after apply)
          [32m+[0m[0m id                          = (known after apply)
          [32m+[0m[0m initial_node_count          = (known after apply)
          [32m+[0m[0m instance_group_urls         = (known after apply)
          [32m+[0m[0m location                    = (known after apply)
          [32m+[0m[0m managed_instance_group_urls = (known after apply)
          [32m+[0m[0m max_pods_per_node           = (known after apply)
          [32m+[0m[0m name                        = (known after apply)
          [32m+[0m[0m name_prefix                 = (known after apply)
          [32m+[0m[0m node_count                  = (known after apply)
          [32m+[0m[0m node_locations              = (known after apply)
          [32m+[0m[0m operation                   = (known after apply)
          [32m+[0m[0m project                     = (known after apply)
          [32m+[0m[0m version                     = (known after apply)
        } -> (known after apply)
    }

[1m  # module.gke.google_container_cluster.primary[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_container_cluster" "primary" {
        id                                       = "projects/ctrl-plane-prod-b1b92df2/locations/us-central1/clusters/observability-stack-uvm2"
        name                                     = "observability-stack-uvm2"
        [90m# (29 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m addons_config {
          [32m+[0m[0m gcs_fuse_csi_driver_config {
              [32m+[0m[0m enabled = true
            }

            [90m# (8 unchanged blocks hidden)[0m[0m
        }

        [90m# (24 unchanged blocks hidden)[0m[0m
    }

[1m  # module.gke.google_container_node_pool.pools["backend"][0m will be created
[0m  [32m+[0m[0m resource "google_container_node_pool" "pools" {
      [32m+[0m[0m cluster                     = "observability-stack-uvm2"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m initial_node_count          = 0
      [32m+[0m[0m instance_group_urls         = (known after apply)
      [32m+[0m[0m location                    = "us-central1"
      [32m+[0m[0m managed_instance_group_urls = (known after apply)
      [32m+[0m[0m max_pods_per_node           = 25
      [32m+[0m[0m name                        = "backend"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m node_count                  = (known after apply)
      [32m+[0m[0m node_locations              = (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [32m+[0m[0m project                     = "ctrl-plane-prod-b1b92df2"
      [32m+[0m[0m version                     = (known after apply)

      [32m+[0m[0m autoscaling {
          [32m+[0m[0m location_policy = (known after apply)
          [32m+[0m[0m max_node_count  = 20
          [32m+[0m[0m min_node_count  = 0
        }

      [32m+[0m[0m management {
          [32m+[0m[0m auto_repair  = true
          [32m+[0m[0m auto_upgrade = true
        }

      [32m+[0m[0m network_config (known after apply)

      [32m+[0m[0m node_config {
          [32m+[0m[0m disk_size_gb      = 30
          [32m+[0m[0m disk_type         = "pd-standard"
          [32m+[0m[0m effective_taints  = (known after apply)
          [32m+[0m[0m guest_accelerator = (known after apply)
          [32m+[0m[0m image_type        = "COS_CONTAINERD"
          [32m+[0m[0m labels            = {
              [32m+[0m[0m "cluster_name" = "observability-stack-uvm2"
              [32m+[0m[0m "node_pool"    = "backend"
            }
          [32m+[0m[0m local_ssd_count   = 0
          [32m+[0m[0m logging_variant   = "DEFAULT"
          [32m+[0m[0m machine_type      = "e2-standard-2"
          [32m+[0m[0m metadata          = {
              [32m+[0m[0m "cluster_name"             = "observability-stack-uvm2"
              [32m+[0m[0m "disable-legacy-endpoints" = "false"
              [32m+[0m[0m "node_pool"                = "backend"
            }
          [32m+[0m[0m min_cpu_platform  = (known after apply)
          [32m+[0m[0m oauth_scopes      = [
              [32m+[0m[0m "https://www.googleapis.com/auth/cloud-platform",
            ]
          [32m+[0m[0m preemptible       = false
          [32m+[0m[0m resource_labels   = {
              [32m+[0m[0m "goog-gke-node-pool-provisioning-model" = "on-demand"
            }
          [32m+[0m[0m service_account   = "gke-obs-uvm2-nodes-sa@ctrl-plane-prod-b1b92df2.iam.gserviceaccount.com"
          [32m+[0m[0m spot              = false
          [32m+[0m[0m tags              = [
              [32m+[0m[0m "gke-observability-stack-uvm2",
              [32m+[0m[0m "gke-observability-stack-uvm2-backend",
            ]

          [32m+[0m[0m confidential_nodes (known after apply)

          [32m+[0m[0m gcfs_config (known after apply)

          [32m+[0m[0m kubelet_config (known after apply)

          [32m+[0m[0m shielded_instance_config {
              [32m+[0m[0m enable_integrity_monitoring = true
              [32m+[0m[0m enable_secure_boot          = false
            }

          [32m+[0m[0m workload_metadata_config {
              [32m+[0m[0m mode = "GKE_METADATA"
            }
        }

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "45m"
          [32m+[0m[0m delete = "45m"
          [32m+[0m[0m update = "45m"
        }

      [32m+[0m[0m upgrade_settings {
          [32m+[0m[0m max_surge       = 1
          [32m+[0m[0m max_unavailable = 0
          [32m+[0m[0m strategy        = "SURGE"

          [32m+[0m[0m blue_green_settings (known after apply)
        }
    }

[1mPlan:[0m 3 to add, 1 to change, 1 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m cluster_name              = "observability-stack-uvm2" -> (known after apply)
```
    